//
//  Error.strings
//  TheBox iOS
//
//  Copyright (c) 2017 TWS. All rights reserved.
//
//  Author Marino Faggiana <m.faggiana@twsweb.it>
//
//  This program is free software: you can redistribute it and/or modify
//  it under the terms of the GNU General Public License as published by
//  the Free Software Foundation, either version 3 of the License, or
//  (at your option) any later version.
//
//  This program is distributed in the hope that it will be useful,
//  but WITHOUT ANY WARRANTY; without even the implied warranty of
//  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
//  GNU General Public License for more details.
//
//  You should have received a copy of the GNU General Public License
//  along with this program.  If not, see <http://www.gnu.org/licenses/>.
//


"_bad_username_password_"               = "Zła nazwa użytkownika lub hasło";
"_cancelled_by_user"                    = "Przeniesienie anulowane";
"_error_folder_destiny_is_the_same_"    = "Brak możliwości, aby przenieść katalog do sobie";
"_error_not_permission_"                = "Nie masz uprawnień, aby zakończyć operację";
"_error_path_"                          = "Nie można otworzyć tego pliku lub folderu. Należy upewnić się, czy istnieje";
"_file_upload_not_exitst_"              = "Plik, który chcesz wysłać, nie istnieje";
"_forbidden_characters_from_server_"    = "Nazwa zawiera co najmniej jeden nieprawidłowy znak";
"_not_connected_internet_"              = "Błąd połączenia z serwerem";
"_not_possible_connect_to_server_"      = "Nie jest możliwe, aby połączyć się z serwerem w tym momencie";
"_not_possible_create_folder_"          = "Folder nie może zostać utworzony";
"_server_down_"                         = "Serwer jest nieosiągalny";
"_time_out_"                            = "Przekroczony limit czasu, spróbuj ponownie";
"_unknow_response_server_"              = "Brak odpowiedzi z serwera";
"_user_autentication_required_"         = "Wymagana weryfikacja użytkownika";
"_file_directory_locked_"               = "Brak dostępu do pliku lub katalogu";
"_ssl_certificate_untrusted_"           = "Certyfikat dla tego serwera jest niepoprawny";
"_internal_server_"                     = "Wewnętrzny błąd serwera";

"_file_already_exists_"                 = "Nie można zakończyć operacji, istnieje plik o tej samej nazwie";
"_file_folder_not_exists_"              = "Plik źródłowy nie został znaleziony w podanej ścieżce";
"_folder_contents_nochanged_"           = "Zawartość folderów nie uległa zmianie";
"_images_invalid_converted_"            = "Obraz jest nieaktualny i nie może być zamieniony na miniaturze";
"_method_not_expected_"                 = "Nieoczekiwana metoda żądania";
"_reauthenticate_user_"                 = "Dostęp wygasł, proszę uwierzytelnić ponownie użytkownika";
"_server_error_retry_"                  = "Serwer jest tymczasowo niedostępny";
"_too_many_files_"                      = "Zbyt wiele wybranych plików do działania, aby zakończyła się sukcesem";
"_too_many_request_"                    = "Osiągnięto limit - wysłano zbyt dużo zapytań";
"_user_over_quota_"                     = "Limit pojemności został osiągnięty";

"_ssl_connection_error_"                = "Błąd połączenia SSL, spróbuj ponownie";
